# coding:gbk

print('-'*10,'随机禁用干员程序','-'*10)

date= ["九色鹿","暮落","灵知","极光","耶拉","耀骑士临光","焰尾","蚀清","野鬃","蜜莓","布丁","正义骑士号","远牙","灰毫","琴柳","桑葚","罗比菈塔","假日威龙陈","水月","羽毛笔","龙舌兰","帕拉斯","卡涅利安","绮良","贝娜","深靛","浊心斯卡蒂","凯尔希","歌蕾蒂娅","赤冬","异客","熔泉","暴雨","灰烬","霜华","闪击","战车","夕","嵯峨","乌有","炎狱炎熔","图耶","空弦","爱丽丝","豆苗","山","卡夫卡","罗宾","松果","阿米娅（近卫）","迷迭香","泥岩","絮雨","杰克","瑕光","奥斯塔","鞭刃","泡泡","史尔特尔","四月","簿绿","芳汀","森蚺","燧石","特米米","酸糖","棘刺","安哲拉","孑","贾维","蜜蜡","稀音","铃兰","断崖","亚叶","卡达","早露","莱恩哈特","苦艾","波登可","月禾","石棉","W","温蒂","极境","THRM-EX","傀影","巫恋","铸铁","刻刀","断罪者","风笛","慑砂","柏喙","宴","清流","刻俄柏","惊蛰","年","阿","吽","雪雉","煌","灰喉","安比尔","布洛卡","苇草","莫斯提马","槐琥","拜松","梅","微风","伊桑","麦哲伦","送葬人","炎客","红云","坚雷","赫拉格","星极","桃金娘","黑","格劳克斯","锡兰","苏苏洛","陈","诗怀雅","格雷伊","斑点","泡普卡","斯卡蒂","格拉尼","夜魔","猎蜂","月见夜","空爆","暴行","银灰","塞雷娅","星熊","夜莺","闪灵","安洁莉娜","艾雅法拉","伊芙利特","推进之王","能天使","食铁兽","狮蝎","空","真理","初雪","崖心","守林人","普罗旺斯","火神","可颂","雷蛇","红","临光","华法琳","赫默","梅尔","天火","阿米娅","陨星","白金","蓝毒","幽灵鲨","拉普兰德","因陀罗","芙兰卡","德克萨斯","凛冬","白面鸮","阿消","地灵","深海色","古米","蛇屠箱","角峰","调香师","嘉维尔","末药","暗索","砾","慕斯","艾斯黛尔","霜叶","缠丸","杜宾","红豆","清道夫","迅使","白雪","流星","杰西卡","远山","夜烟","梓兰","史都华德","安赛尔","芙蓉","炎熔","安德切尔","克洛丝","米格鲁","卡缇","玫兰莎","翎羽","香草","芬","12F","杜林","巡林者","黑角","夜刀","Castle-3","Lancet-2"]

undate=[]

import random

lened=len(date)

while lened>1:
    if input("还要继续禁用吗?(y/n):")=="y":
        lened=len(date)
        print(f'可用干员{lened}位')

        rand=random.randint(0,lened-1)
        print(f'禁用{date[rand]}')

        undate.append(date[rand])
        date.remove(date[rand])

        print(undate)
        print(date)
    else:
        break
